let heart = document.getElementById("heart");
let message = document.getElementById("message");

heart.onclick = () => {
    heart.style.color = "#fff";
    heart.innerHTML = "🎉🌟 Happy Birthday Ruqaya 🌟🎉";
    message.innerHTML = `سلام عليكم و رحمه الله و بركاته<br><br>
                        عامله ايه يا رقيه ابقي طمنيني عليكي<br><br>
                        انتي وحشتيني بس متقلقيش يعني انا مش راجع علشان حاجه و لا علشان نرجع الي كان انا راجع علشان عيد ميلادك بس بالمناسبه النهارده 29 و انا عارف ان عيد ميلادك يوم 28 انا مكنتش ناسي ابدا بالعكس دا انا فاكر المعاد من زمان و كل يوم في بالي بس كنت متردد مكنتش عايز اظهر في حياتك تاني بس محبتش افوته عموما انا همشي تاني متقلقيش بس بما اني جيت طمنيني عليكي و خلاص<br><br>
                        —————————————————————<br><br>
                         المهم كل سنة و انتِ طيبة يا رقيه🤍 كل سنة و انتِ بخير و صحه و عافيه ❤️❤️يا رب تبقي دايما بخير و تبقى كويسه دايما🤲🤍 و أتمنى اشوفك السنة الجايه في نجاح و يا رب تبقي مبسوطه🤍🤍`;
    message.style.display = "block";
    
    // إطلاق قصاصات الورق الملونة
    confetti({
        particleCount: 100,
        spread: 70,
        origin: { y: 0.6 }
    });
};
